tap "adoptopenjdk/openjdk"
tap "aquasecurity/trivy"
tap "elastic/tap"
tap "gabrie30/utils"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "microsoft/git"
tap "puppetlabs/puppet"
tap "rbenv/tap"
tap "starkandwayne/cf"
tap "theory/sqitch"
tap "wata727/tflint"
brew "gettext"
brew "openssl@1.1"
brew "pkg-config"
brew "gobject-introspection"
brew "adwaita-icon-theme"
brew "ansible-lint"
brew "autoenv"
brew "autojump"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bandit"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "coreutils"
brew "cask"
brew "checkov"
brew "cmake"
brew "cowsay"
brew "dnstracer"
brew "ec2-ami-tools"
brew "fish"
brew "fortune"
brew "fzf"
brew "git"
brew "git-cola"
brew "git-flow"
brew "git-gui"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "go-bindata"
brew "go-jira"
brew "graphviz"
brew "grep"
brew "gtk+"
brew "gtk-mac-integration"
brew "gtksourceview3"
brew "helm"
brew "htop"
brew "httpie"
brew "httping"
brew "imagemagick"
brew "intltool"
brew "itstool"
brew "jo"
brew "jq"
brew "jython"
brew "kubernetes-cli"
brew "kubectx"
brew "libsodium"
brew "qemu"
brew "lima"
brew "mackup"
brew "macvim"
brew "mercurial"
brew "minikube"
brew "mono"
brew "moreutils"
brew "mvnvm"
brew "mysql"
brew "newrelic-cli"
brew "nmap"
brew "nomad"
brew "openjdk@11"
brew "packer"
brew "packer-completion"
brew "pandoc"
brew "plantuml"
brew "prettier"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygobject3"
brew "qt"
brew "qscintilla2"
brew "rancher-cli"
brew "rancher-compose"
brew "rbenv"
brew "rdesktop", link: false
brew "rename"
brew "rke"
brew "rpm"
brew "s3cmd"
brew "sphinx-doc"
brew "stern"
brew "tcptrace"
brew "tcptraceroute"
brew "telnet"
brew "terraformer"
brew "terrascan"
brew "tfenv"
brew "tflint"
brew "thefuck"
brew "tiger-vnc"
brew "tkdiff"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "wireshark", link: false
brew "with-readline"
brew "zsh"
brew "aquasecurity/trivy/trivy"
brew "gabrie30/utils/ghorg"
brew "rbenv/tap/openssl@1.0"
brew "starkandwayne/cf/safe"
cask "apache-directory-studio"
cask "dia"
cask "dotnet"
cask "git-credential-manager-core"
cask "http-toolkit"
cask "hyper"
cask "inkscape"
cask "jad"
cask "java11"
cask "kdiff3"
cask "keybase"
cask "macdown"
cask "meld"
cask "openvisualtraceroute"
cask "opera"
cask "powershell"
cask "puppet-agent"
cask "vagrant"
cask "wireshark"
cask "zenmap"
