# This is my brewfile - be it good Or bad
# frozen_string_literal: false

tap 'adoptopenjdk/openjdk'
tap 'aquasecurity/trivy'
tap 'derailed/k9s'
tap 'elastic/tap'
tap 'gabrie30/utils'
tap 'gitguardian/tap'
tap 'glensc/git-mr', 'https://gitlab.com/glensc/git-mr'
tap 'gromgit/fuse'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/core'
tap 'jakehilborn/jakehilborn'
tap 'microsoft/git'
tap 'puppetlabs/puppet'
tap 'rbenv/tap'
tap 'starkandwayne/cf'
tap 'theory/sqitch'
tap 'wata727/tflint'
brew 'gettext'
brew 'openssl@1.1'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'adwaita-icon-theme'
brew 'ansible-lint'
brew 'autoenv'
brew 'autojump'
brew 'automake'
brew 'awscli'
brew 'azure-cli'
brew 'bandit'
brew 'bash'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'coreutils'
brew 'ca-certificates'
brew 'cask'
brew 'checkov'
brew 'checkstyle'
brew 'cmake'
brew 'cowsay'
brew 'detect-secrets'
brew 'dnstracer'
brew 'dotenv-linter'
brew 'ec2-ami-tools'
brew 'fish'
brew 'fortune'
brew 'frum'
brew 'fzf'
brew 'git'
brew 'git-cola'
brew 'git-flow'
brew 'git-gui'
brew 'git-hooks-go'
brew 'git-lfs'
brew 'git-secrets'
brew 'gitlint'
brew 'gnupg'
brew 'go'
brew 'go-bindata'
brew 'go-jira'
brew 'graphviz'
brew 'grep'
brew 'gtk+'
brew 'gtk-mac-integration'
brew 'gtksourceview3'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'httping'
brew 'imagemagick'
brew 'intltool'
brew 'itstool'
brew 'jo'
brew 'jq'
brew 'jsonlint'
brew 'jython'
brew 'kube-linter'
brew 'kubernetes-cli'
brew 'kubectx'
# cask "lastpass"
brew 'lastpass-cli'
brew 'libsodium'
brew 'qemu'
brew 'lima'
brew 'mackup'
brew 'macvim'
brew 'mercurial'
brew 'minikube'
brew 'mono'
brew 'moreutils'
brew 'mvnvm'
brew 'mysql'
brew 'newrelic-cli'
brew 'nmap'
brew 'nomad'
brew 'openjdk@11'
brew 'packer'
brew 'packer-completion'
brew 'pandoc'
brew 'plantuml'
brew 'prettier'
brew 'py3cairo'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pygobject3'
brew 'qt'
brew 'qscintilla2'
brew 'rancher-cli'
brew 'rancher-compose'
brew 'rbenv'
brew 'rbenv-bundle-exec'
brew 'rbenv-bundler'
brew 'rbenv-bundler-ruby-version'
brew 'rbenv-default-gems'
brew 'rclone'
brew 'rdesktop', link: false
brew 'rename'
brew 'rke'
brew 'rpm'
brew 'rsync'
brew 's3cmd'
brew 'sphinx-doc'
brew 'stern'
brew 'syncthing'
brew 'tcptrace'
brew 'tcptraceroute'
brew 'telnet'
brew 'terraform-docs'
brew 'terraform-inventory'
brew 'terraform-ls'
brew 'terraform-rover', args: ['ignore-dependencies']
brew 'terraformer'
brew 'terraforming'
brew 'terragrunt', args: %w[ignore-dependencies no-binaries]
brew 'terrascan'
brew 'tfenv'
brew 'tflint'
brew 'tgenv'
brew 'thefuck'
brew 'tiger-vnc'
brew 'tkdiff'
brew 'tmux'
brew 'tree'
brew 'tty-clock'
brew 'vagrant-completion'
brew 'vault'
brew 'watch'
brew 'wget'
brew 'wireshark', link: false
brew 'with-readline'
brew 'yamllint'
brew 'zsh'
brew 'aquasecurity/trivy/trivy'
brew 'derailed/k9s/k9s'
brew 'gabrie30/utils/ghorg'
brew 'gitguardian/tap/ggshield'
brew 'glensc/git-mr/git-mr'
cask 'macfuse'
# brew 'gromgit/fuse/sshfs-mac'                 #use sshfs from osxfuse.github.io
brew 'jakehilborn/jakehilborn/displayplacer'
brew 'rbenv/tap/openssl@1.0'
brew 'starkandwayne/cf/safe'
brew 'whalebrew'
brew 'podman'
cask 'alfred'
cask 'apache-directory-studio'
cask 'bartender'
cask 'brave-browser'
cask 'brave-browser-beta'
cask 'calibre'
cask 'clock'
cask 'controlplane'
cask 'default-folder-x'
cask 'dia'
# cask "dotnet"
cask 'dotnet-sdk'
cask 'flycut'
cask 'git-credential-manager-core'
cask 'github'
# cask "google-chat-electron"
cask 'http-toolkit'
cask 'hyper'
cask 'inkscape'
# cask "jad"
# cask "java11"
cask 'kdiff3'
# cask "keybase"
cask 'keycastr'
cask 'lens'
cask 'macdown'
cask 'meld'
cask 'microsoft-edge-beta'
cask 'moom'
cask 'multipass'
cask 'openvisualtraceroute'
cask 'opera'
cask 'postman'
cask 'postman-agent'
cask 'powershell'
cask 'puppet-agent'
cask 'royal-tsx'
cask 'snipaste'
cask 'sourcetree'
cask 'the-clock'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'wireshark'
cask 'zenmap'
cask 'google-chrome'
cask 'google-chrome-canary'
brew 'docker'
cask 'plantronics-hub'
cask 'logitech-unifying'
cask 'logi-options-plus'
cask 'logitech-options'
mas 'Amphetamine', id: 937_984_704
mas 'Battery Monitor', id: 836_505_650
mas 'Be Focused', id: 973_134_470
mas 'Caffeinated', id: 1_362_171_212
mas 'CopyClip', id: 595_191_960
mas 'CopyLess 2', id: 993_841_014
mas 'Desktop Clock', id: 894_760_156
mas 'Evernote', id: 406_056_744
mas 'Fantastical', id: 975_937_182
# mas "Ghostery Lite", id: 1436953057
# mas "Jira", id: 1475897096
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft OneNote", id: 784801555
# mas "Microsoft Outlook", id: 985367838
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Remote Desktop", id: 1295203466
# mas "Microsoft Remote Desktop", id: 715768417
# mas "Microsoft To Do", id: 1274495053
# mas "Microsoft Word", id: 462054704
# mas "OneDrive", id: 823766827
mas 'Skitch', id: 425_955_336
mas 'Slack', id: 803_453_959
mas 'Todoist', id: 585_829_637
mas 'Xcode', id: 497_799_835
mas 'XnConvert', id: 436_203_431
